#+title: Machine Learning
#+SUBTITLE: Lecture 1 - Introductions
#+author: Jay Morgan
#+date: 9th October 2022
#+startup: beamer
#+include: ./header.org
#+property: header-args:python :eval never-export :results none :exports none :session

#+begin_src python
import numpy as np
import pandas as pd
np.set_printoptions(suppress=True)
#+end_src

*** Source code

During the course, I would also like to supplement my algorithmic definitions and
explanations with some programming code -- for this I will use the [[https://www.python.org/][Python]] programming
language. The code snippets would look something like:

#+begin_src python :results output replace :exports both
import random
x = [1, 2, 3, 4]
y = [random.random() + xi for xi in x]
print(y)
#+end_src

#+RESULTS:
: [1.4898241502582414, 2.4805286156642175, 3.065379052563245, 4.05328483072365]

*** Boston House Prices -- example rows

#+begin_src python :exports both :results output replace
import warnings
from sklearn.datasets import load_boston
with warnings.catch_warnings():
    warnings.filterwarnings("ignore")
    boston = load_boston()
boston = pd.DataFrame(
    data=np.c_[boston['data'], boston['target']],
    columns=boston['feature_names'].tolist() + ['target'])
print(boston[:2])
#+end_src

#+RESULTS:
:       CRIM    ZN  INDUS  CHAS    NOX     RM  ...  RAD    TAX  PTRATIO      B  LSTAT  target
: 0  0.00632  18.0   2.31   0.0  0.538  6.575  ...  1.0  296.0     15.3  396.9   4.98    24.0
: 1  0.02731   0.0   7.07   0.0  0.469  6.421  ...  2.0  242.0     17.8  396.9   9.14    21.6
: 
: [2 rows x 14 columns]

*** Iris Dataset -- example rows

#+begin_src python :exports both :results output replace
from sklearn.datasets import load_iris
iris = load_iris()
iris = pd.DataFrame(
    data = np.c_[iris['data'], iris['target']],
    columns = iris['feature_names'] + ['target'])
print(iris.head(2))
#+end_src

#+RESULTS:
:    sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)  target
: 0                5.1               3.5                1.4               0.2     0.0
: 1                4.9               3.0                1.4               0.2     0.0

